# 131
# for문의 실행결과를 예측하라.
과일 = ["사과", "귤", "수박"]
for 변수 in 과일:
    print(변수)
    #사과
    #귤
    #수박
# 132
# for문의 실행결과를 예측하라.
과일 = ["사과", "귤", "수박"]
for 변수 in 과일:
  print("#####")
  #####
  #####
  #####

# 133
# 다음 for 문과 동일한 기능을 수행하는 코드를 작성하세요.
for 변수 in ["A", "B", "C"]:
  print(변수)

변수1 = 'A'
변수2 = 'B'
변수3 = 'C'

print(변수1);print(변수2);print(변수3)



# 134
# for문을 풀어서 동일한 동작을하는 코드를 작성하라.
for 변수 in ["A", "B", "C"]:
   print("출력:", 변수)

변수1 = 'A'
변수2 = 'B'
변수3 = 'C'
print('출력 : '+ 변수1);print('출력 : '+변수2);print('출력 : '+변수3)

# 136
# 다음 코드를 for문으로 작성하라.
# 변수 = 10
# print(변수)
# 변수 = 20
# print(변수)
# 변수 = 30
# print(변수)

for 변수 in [10,20,30]:
    print(변수)

# 137
# 다음 코드를 for문으로 작성하라.
# print(10)
# print(20)
# print(30)
for i in [10,20,30]:
    print(i)

# 138
# 다음 코드를 for문으로 작성하라.
# print(10)
# print("-------")
# print(20)
# print("-------")
# print(30)
# print("-------")
for i in [10,20,30]:
    print(i)
    print('-------')
# 139
# 다음 코드를 for문으로 작성하라.
# print("++++")
# print(10)
# print(20)
# print(30)

for i in ['++++',10,20,30]:
    print(i)

print('++++')
for i in [10,20,30]:
    print(i)

# 140
# 다음 코드를 for문으로 작성하라.
# print("-------")
# print("-------")
# print("-------")
# print("-------")
for i in [1,2,3,4]:
    print('-------')
# 파이썬 for문은 들여쓰기된 코드가 자료구조의 데이터 개수만큼 반복된다는 사실이 중요합니다.








